#include <vector>

#pragma once
// by FirstAfterGod2501

// Методы vector


// Конструкторы


#define vector  вектор // может использоваться как конструктор и как деструктор
// Операторы
#define $2 $1
#define $2 $1
// ---------------------------------------------------------------------
// Доступ к элементам
#define $2 $1
#define $2 $1
#define $2 $1
// ---------------------------------------------------------------------
// Итераторы
#define $2 $1
#define $2 $1
#define $2 $1
#define $2 $1
// ---------------------------------------------------------------------
// Работа с размером вектора
#define $2 $1
#define $2 $1
#define $2 $1
#define $2 $1
#define $2 $1
#define $2 $1
// ---------------------------------------------------------------------
// Модификаторы
#define $2 $1
#define $2 $1
#define $2 $1
#define $2 $1
#define $2 $1
#define $2 $1
#define $2 $1
// ---------------------------------------------------------------------
// Другие методы
#define $2 $1
#define $2 $1
